Revit 2027 API
MetallicPaint.MetallicpaintFinish Property
 The property labeled "Finish" from the "MetallicPaint" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string MetallicpaintFinish { get; }
Public Shared ReadOnly Property MetallicpaintFinish As String
	Get
public:
static property String^ MetallicpaintFinish {
	String^ get ();
}
static member MetallicpaintFinish : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MetallicpaintFinishType".
See Also
Reference
MetallicPaint Class
Autodesk.Revit.DB.Visual Namespace